gcc -g p6final.c
 ./a.out
Enter a word: hello
Enter a word: world
world is greater than hello
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x90c: file p6final.c, line 61.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:61
61    {
(gdb) n
64      input_two_string(a, b);
(gdb) s
input_two_string (a=0x7ffd8ae03070 "\001", b=0x7ffd8ae03090 "\200\t")
    at p6final.c:4
4       printf("Enter a word: ");
(gdb) n
5       scanf("%s", a);
(gdb) n
Enter a word: hello
6       printf("Enter a word: ");
(gdb) n
7       scanf("%s", b);
(gdb) n
Enter a word: world
8     }
(gdb) n
main () at p6final.c:65
65      ans = cmp(a, b);
(gdb) n
66      output(a, b, ans);
(gdb) n
world is greater than hello
67      return 0;
(gdb) c
Continuing.
[Inferior 1 (process 34) exited normally]
(gdb) 